{
    "testimonials": [
        {
            "id": 1,
            "text": "I thought I will forever be a hospital cleaner, but it has changed my mind set when I undergo the program in patient care and graduate with honors. Now I am currently working as Patient Care Technician (PCT) at National Guard Hospital in Jeddah, Saudi Arabia.",
            "author": "Mirriam Manaligod"
        },
        {
            "id": 2,
            "text": "I was a graduate in Engineering Degree Program and been working as company purchaser for a decade. I have found FHTD Academy and made me a new person with vision of providing patient care.",
            "author": "Wilson Serquena"
        },
        {
            "id": 3,
            "text": "I was just a household service worker dreaming to be a Nurse Assistant. When I met the FHTD Academy, Academic Affairs and Training Director and had a long heart to heart talks about my life and dreams, he immediately offered me a 100% Tuition FREE to study Patient Care Services. Thank you FHTD Academy for providing me the holistic, responsive and life-saving education.",
            "author": "Liza Ramos"
        },
        {
            "id": 4,
            "text": "Thank you to the Academy administration, teachers and the hardworking admins. You have all provided a valuable assistance and support throughout our journey. Your patience and knowledge have helped us to grow and learn every day, and your dedication has made our experience at the school memorable. Thank you FHTD Academy and ITESD, you have changed my life for the better. ",
            "author": "Fatima Hassan."
        },
        {
            "id": 5,
            "text": "I was a Medical Insurance Processor at GNP Khamis Mushait Branch (now Tadawi Medical Hospital) and looking for an extra-income to offset the daily expenses of my family. When I searched online, an ad pop up for a part time job as Administration Officer. I immediately contacting the establishment and got the job. Now, I am delegated as the FHTD Academy Khamis Mushait Branch Registrar. Thank you FHTD Academy for the opportunity.",
            "author": "Victor Aragon Jr."
        },
        {
            "id": 6,
            "text": "Thank you FHTD Academy for the knowledge, skills and competencies that you have provided in Physio-therapy Assistant Program. Your program is so effective in the physical rehabilitation of patients. I am proudly to say that it helped me a lot when applying here in the United Kingdom.",
            "author": "Elvis Eaton"
        },
        {
            "id": 7,
            "text": "I was a low-paid employee before I studied at FHTD Academy. After the completion of my Patient Care Services Program, I applied as Nurse Assistant here in Riyadh and now enjoying my high-earned salary monthly. Thank you FHTD Academy, you have changed my life for the better.",
            "author": "Angel Sumalian"
        }
    ]
}
